#+TITLE: Doom config

*** Set up TODO keywords
#+begin_src emacs-lisp :tangle yes
(after! org
  (setq org-todo-keywords
        '((sequence "TODO(t)" "AWAIT(a)" "BLOCKED(b)" "IDEA(i)" "|" "DONE(d)" "CANCELED(c)")
          (sequence "MEETING(m)" "EVENT(v)" "|" "ENDED(e)" "CANCELED(c)" "SKIPPED(s)")
          (sequence "[ ](T)" "[-](S)" "[?](W)" "|" "[x](D)")))
  )
#+end_src

#+RESULTS:
| sequence | TODO(t)    | AWAIT(a) | BLOCKED(b) | IDEA(i) |          |             | DONE(d)    | CANCELED(c) |
| sequence | MEETING(m) | EVENT(v) |            |         | ENDED(e) | CANCELED(c) | SKIPPED(s) |             |
| sequence | [ ](T)     | [-](S)   | [?](W)     |         |          | [x](D)      |            |             |

*** Capture templates
#+begin_src emacs-lisp :tangle yes
(after! org
  (setq org-capture-templates
        '(
          ("t" "Todo" entry (file+headline +org-capture-todo-file "Inbox")
           "* TODO %?\n%U" :empty-lines 1)
          ("p" "Personal" entry (file+headline "~/gdrive/notes/personal.org" "Inbox")
           "* TODO %?\n%U" :empty-lines 1)
          ("b" "Book" entry (file+headline "~/notes/books.org" "Inbox")
           "* TODO %?\n%U" :empty-lines 1)
          )))
;; (setq org-capture-templates
;;       '(("t" "Personal todo" entry (file+headline +org-capture-todo-file "Inbox")
;;          "* TODO %?\n %i\n %a" :prepend t)
;;         ("n" "Personal notes" entry (file+headline +org-capture-notes-file "Inbox") "* %u %? %i %a" :prepend t)
;;         ("j" "Journal" entry (file+olp+datetree +org-capture-journal-file) "* %U %? %i %a" :prepend t)
;;         ("p" "Templates for projects") ("pt" "Project-local todo" entry (file+headline +org-capture-project-todo-file "Inbox") "* TODO %? %i %a" :prepend t)
;;         ("pn" "Project-local notes" entry (file+headline +org-capture-project-notes-file "Inbox") "* %U %? %i %a" :prepend t)
;;         ("pc" "Project-local changelog" entry (file+headline +org-capture-project-changelog-file "Unreleased") "* %U %? %i %a" :prepend t)
;;         ("o" "Centralized templates for projects") ("ot" "Project todo" entry #'+org-capture-central-project-todo-file "* TODO %? %i %a" :heading "Tasks" :prepend nil)
;;         ("on" "Project notes" entry #'+org-capture-central-project-notes-file "* %U %? %i %a" :heading "Notes" :prepend t)
;;         ("oc" "Project changelog" entry #'+org-capture-central-project-changelog-file "* %U %? %i %a" :heading "Changelog" :prepend t)))
#+end_src

#+RESULTS:
| t | Todo | entry | (file+headline +org-capture-todo-file Inbox) | * TODO %? |

*** Set default display width
#+begin_src emacs-lisp :tangle yes
(after! org (setq org-image-actual-width 300))
#+end_src

#+RESULTS:
: 300

#+begin_src elisp
(setq image-file-name-extensions '("png" "jpeg" "jpg" "gif" "tiff" "tif" "xbm" "xpm" "pbm" "pgm" "ppm" "pnm" "svg" "heic")
)
#+end_src

